БухЭксп/InformationRegisters/CW_ПраваДоступаДляПараметровМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПраваДоступаДляПараметровМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПраваДоступаДляПараметровМониторинга/Ext/ManagerModule.bsl
Функция ПолучитьДоступныеПараметры(Знач ГруппаПользователя = Неопределено) Экспорт
	
	Если ГруппаПользователя = Неопределено Тогда
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;    
	
	Если CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПраваДоступаДляПараметровМониторинга.Параметр КАК Параметр,
	|	CW_ПраваДоступаДляПараметровМониторинга.Просмотр КАК Просмотр,
	|	CW_ПраваДоступаДляПараметровМониторинга.Редактирование КАК Редактирование
	|ИЗ
	|	РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	|ГДЕ
	|	CW_ПраваДоступаДляПараметровМониторинга.Группа = &ГруппаПользователя";  
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивПросмотр 			= Новый Массив;
	МассивРедактирование 	= Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();  
	Пока Выборка.Следующий() Цикл
		Если Выборка.Редактирование Тогда
			МассивРедактирование.Добавить(Выборка.Параметр);
		КонецЕсли;
		Если Выборка.Просмотр Тогда
			МассивПросмотр.Добавить(Выборка.Параметр);
		КонецЕсли;  
	КонецЦикла;
	
	Структура = Новый Структура; 
	Структура.Вставить("Просмотр", 			МассивПросмотр);
	Структура.Вставить("Редактирование", 	МассивРедактирование);
	
	Возврат Структура; 
	
КонецФункции  

Функция ПолучитьДоступностьПараметра(Параметр, ГруппаПользователя=Неопределено) Экспорт
	
	Структура = Новый Структура("Просмотр,Редактирование", Истина, Истина);
	
	Если ГруппаПользователя = Неопределено Тогда
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;    
	
	Если CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь) Тогда
		Возврат Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ПраваДоступаДляПараметровМониторинга.Параметр КАК Параметр,
	|	CW_ПраваДоступаДляПараметровМониторинга.Просмотр КАК Просмотр,
	|	CW_ПраваДоступаДляПараметровМониторинга.Редактирование КАК Редактирование
	|ИЗ
	|	РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	|ГДЕ
	|	CW_ПраваДоступаДляПараметровМониторинга.Группа = &ГруппаПользователя
	|	И CW_ПраваДоступаДляПараметровМониторинга.Параметр = &Параметр";  
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	Запрос.УстановитьПараметр("Параметр", Параметр);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Структура;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();  
	Если Выборка.Следующий() Тогда
		Структура.Вставить("Просмотр", 			Выборка.Просмотр);
		Структура.Вставить("Редактирование", 	Выборка.Редактирование);
	КонецЕсли;
	
	Возврат Структура; 
	
КонецФункции
